zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph0/PERI_SIM.h
/*! @name FTMOPT0 - FTM Option Register 0 */
/*! @{ */

#define SIM_FTMOPT0_FTM0FLTXSEL_MASK             (0x7U)
#define SIM_FTMOPT0_FTM0FLTXSEL_SHIFT            (0U)
/*! FTM0FLTxSEL - FTM0 Fault X Select
 *  0b000..FTM0_FLTx pin
 *  0b001..TRGMUX_FTM0 out
 */
#define SIM_FTMOPT0_FTM0FLTXSEL(x)               (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM0FLTXSEL_SHIFT)) & SIM_FTMOPT0_FTM0FLTXSEL_MASK)

#define SIM_FTMOPT0_FTM1FLTXSEL_MASK             (0x70U)
#define SIM_FTMOPT0_FTM1FLTXSEL_SHIFT            (4U)
/*! FTM1FLTxSEL - FTM1 Fault X Select
 *  0b000..FTM1_FLTx pin
 *  0b001..TRGMUX_FTM1 out
 */
#define SIM_FTMOPT0_FTM1FLTXSEL(x)               (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM1FLTXSEL_SHIFT)) & SIM_FTMOPT0_FTM1FLTXSEL_MASK)

#define SIM_FTMOPT0_FTM2FLTXSEL_MASK             (0x700U)
#define SIM_FTMOPT0_FTM2FLTXSEL_SHIFT            (8U)
/*! FTM2FLTxSEL - FTM2 Fault X Select
 *  0b000..FTM2_FLTx pin
 *  0b001..TRGMUX_FTM2 out
 */
#define SIM_FTMOPT0_FTM2FLTXSEL(x)               (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM2FLTXSEL_SHIFT)) & SIM_FTMOPT0_FTM2FLTXSEL_MASK)

#define SIM_FTMOPT0_FTM3FLTXSEL_MASK             (0x7000U)
#define SIM_FTMOPT0_FTM3FLTXSEL_SHIFT            (12U)
/*! FTM3FLTxSEL - FTM3 Fault X Select
 *  0b000..FTM3_FLTx pin
 *  0b001..TRGMUX_FTM3 out
 */
#define SIM_FTMOPT0_FTM3FLTXSEL(x)               (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM3FLTXSEL_SHIFT)) & SIM_FTMOPT0_FTM3FLTXSEL_MASK)

#define SIM_FTMOPT0_FTM4CLKSEL_MASK              (0x30000U)
#define SIM_FTMOPT0_FTM4CLKSEL_SHIFT             (16U)
/*! FTM4CLKSEL - FTM4 External Clock Pin Select
 *  0b00..FTM4 external clock driven by TCLK0 pin.
 *  0b01..FTM4 external clock driven by TCLK1 pin.
 *  0b10..FTM4 external clock driven by TCLK2 pin.
 *  0b11..No clock input
 */
#define SIM_FTMOPT0_FTM4CLKSEL(x)                (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM4CLKSEL_SHIFT)) & SIM_FTMOPT0_FTM4CLKSEL_MASK)

#define SIM_FTMOPT0_FTM5CLKSEL_MASK              (0xC0000U)
#define SIM_FTMOPT0_FTM5CLKSEL_SHIFT             (18U)
/*! FTM5CLKSEL - FTM5 External Clock Pin Select
 *  0b00..FTM5 external clock driven by TCLK0 pin.
 *  0b01..FTM5 external clock driven by TCLK1 pin.
 *  0b10..FTM5 external clock driven by TCLK2 pin.
 *  0b11..No clock input
 */
#define SIM_FTMOPT0_FTM5CLKSEL(x)                (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM5CLKSEL_SHIFT)) & SIM_FTMOPT0_FTM5CLKSEL_MASK)

#define SIM_FTMOPT0_FTM6CLKSEL_MASK              (0x300000U)
#define SIM_FTMOPT0_FTM6CLKSEL_SHIFT             (20U)
/*! FTM6CLKSEL - FTM6 External Clock Pin Select
 *  0b00..FTM6 external clock driven by TCLK0 pin.
 *  0b01..FTM6 external clock driven by TCLK1 pin.
 *  0b10..FTM6 external clock driven by TCLK2 pin.
 *  0b11..No clock input
 */
#define SIM_FTMOPT0_FTM6CLKSEL(x)                (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM6CLKSEL_SHIFT)) & SIM_FTMOPT0_FTM6CLKSEL_MASK)

#define SIM_FTMOPT0_FTM7CLKSEL_MASK              (0xC00000U)
#define SIM_FTMOPT0_FTM7CLKSEL_SHIFT             (22U)
/*! FTM7CLKSEL - FTM7 External Clock Pin Select
 *  0b00..FTM7 external clock driven by TCLK0 pin.
 *  0b01..FTM7 external clock driven by TCLK1 pin.
 *  0b10..FTM7 external clock driven by TCLK2 pin.
 *  0b11..No clock input
 */
#define SIM_FTMOPT0_FTM7CLKSEL(x)                (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM7CLKSEL_SHIFT)) & SIM_FTMOPT0_FTM7CLKSEL_MASK)

#define SIM_FTMOPT0_FTM0CLKSEL_MASK              (0x3000000U)
#define SIM_FTMOPT0_FTM0CLKSEL_SHIFT             (24U)
/*! FTM0CLKSEL - FTM0 External Clock Pin Select
 *  0b00..FTM0 external clock driven by TCLK0 pin.
 *  0b01..FTM0 external clock driven by TCLK1 pin.
 *  0b10..FTM0 external clock driven by TCLK2 pin.
 *  0b11..No clock input
 */
#define SIM_FTMOPT0_FTM0CLKSEL(x)                (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM0CLKSEL_SHIFT)) & SIM_FTMOPT0_FTM0CLKSEL_MASK)

#define SIM_FTMOPT0_FTM1CLKSEL_MASK              (0xC000000U)
#define SIM_FTMOPT0_FTM1CLKSEL_SHIFT             (26U)
/*! FTM1CLKSEL - FTM1 External Clock Pin Select
 *  0b00..FTM1 external clock driven by TCLK0 pin.
 *  0b01..FTM1 external clock driven by TCLK1 pin.
 *  0b10..FTM1 external clock driven by TCLK2 pin.
 *  0b11..No clock input
 */
#define SIM_FTMOPT0_FTM1CLKSEL(x)                (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM1CLKSEL_SHIFT)) & SIM_FTMOPT0_FTM1CLKSEL_MASK)

#define SIM_FTMOPT0_FTM2CLKSEL_MASK              (0x30000000U)
#define SIM_FTMOPT0_FTM2CLKSEL_SHIFT             (28U)
/*! FTM2CLKSEL - FTM2 External Clock Pin Select
 *  0b00..FTM2 external clock driven by TCLK0 pin.
 *  0b01..FTM2 external clock driven by TCLK1 pin.
 *  0b10..FTM2 external clock driven by TCLK2 pin.
 *  0b11..No clock input
 */
#define SIM_FTMOPT0_FTM2CLKSEL(x)                (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM2CLKSEL_SHIFT)) & SIM_FTMOPT0_FTM2CLKSEL_MASK)

#define SIM_FTMOPT0_FTM3CLKSEL_MASK              (0xC0000000U)
#define SIM_FTMOPT0_FTM3CLKSEL_SHIFT             (30U)
/*! FTM3CLKSEL - FTM3 External Clock Pin Select
 *  0b00..FTM3 external clock driven by TCLK0 pin.
 *  0b01..FTM3 external clock driven by TCLK1 pin.
 *  0b10..FTM3 external clock driven by TCLK2 pin.
 *  0b11..No clock input
 */
#define SIM_FTMOPT0_FTM3CLKSEL(x)                (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM3CLKSEL_SHIFT)) & SIM_FTMOPT0_FTM3CLKSEL_MASK)
/*! @} */

/*! @name LPOCLKS - LPO Clock Select Register */
/*! @{ */

#define SIM_LPOCLKS_LPO1KCLKEN_MASK              (0x1U)
#define SIM_LPOCLKS_LPO1KCLKEN_SHIFT             (0U)
/*! LPO1KCLKEN - LPO1K_CLK enable
 *  0b0..Disable LPO1K_CLK output
 *  0b1..Enable LPO1K_CLK output
 */
#define SIM_LPOCLKS_LPO1KCLKEN(x)                (((uint32_t)(((uint32_t)(x)) << SIM_LPOCLKS_LPO1KCLKEN_SHIFT)) & SIM_LPOCLKS_LPO1KCLKEN_MASK)

#define SIM_LPOCLKS_LPO32KCLKEN_MASK             (0x2U)
#define SIM_LPOCLKS_LPO32KCLKEN_SHIFT            (1U)
/*! LPO32KCLKEN - LPO32K_CLK enable
 *  0b0..Disable LPO32K_CLK output
 *  0b1..Enable LPO32K_CLK output
 */
#define SIM_LPOCLKS_LPO32KCLKEN(x)               (((uint32_t)(((uint32_t)(x)) << SIM_LPOCLKS_LPO32KCLKEN_SHIFT)) & SIM_LPOCLKS_LPO32KCLKEN_MASK)

#define SIM_LPOCLKS_LPOCLKSEL_MASK               (0xCU)
#define SIM_LPOCLKS_LPOCLKSEL_SHIFT              (2U)
/*! LPOCLKSEL - LPO clock source select
 *  0b00..LPO128K_CLK
 *  0b01..No clock
 *  0b10..LPO32K_CLK which is derived from the LPO128K_CLK
 *  0b11..LPO1K_CLK which is derived from the LPO128K_CLK
 */
#define SIM_LPOCLKS_LPOCLKSEL(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_LPOCLKS_LPOCLKSEL_SHIFT)) & SIM_LPOCLKS_LPOCLKSEL_MASK)

#define SIM_LPOCLKS_RTCCLKSEL_MASK               (0x30U)
#define SIM_LPOCLKS_RTCCLKSEL_SHIFT              (4U)
/*! RTCCLKSEL - 32 kHz clock source select
 *  0b00..SOSCDIV1_CLK
 *  0b01..LPO32K_CLK
 *  0b10..32 kHz RTC_CLKIN clock
 *  0b11..FIRCDIV1_CLK
 */
#define SIM_LPOCLKS_RTCCLKSEL(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_LPOCLKS_RTCCLKSEL_SHIFT)) & SIM_LPOCLKS_RTCCLKSEL_MASK)
/*! @} */

/*! @name ADCOPT - ADC Options Register */
/*! @{ */

#define SIM_ADCOPT_ADC0TRGSEL_MASK               (0x1U)
#define SIM_ADCOPT_ADC0TRGSEL_SHIFT              (0U)
/*! ADC0TRGSEL - ADC0 trigger source select
 *  0b0..PDB output
 *  0b1..TRGMUX output
 */
#define SIM_ADCOPT_ADC0TRGSEL(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_ADCOPT_ADC0TRGSEL_SHIFT)) & SIM_ADCOPT_ADC0TRGSEL_MASK)

#define SIM_ADCOPT_ADC0SWPRETRG_MASK             (0xEU)
#define SIM_ADCOPT_ADC0SWPRETRG_SHIFT            (1U)
/*! ADC0SWPRETRG - ADC0 software pretrigger sources
 *  0b000..Software pretrigger disabled
 *  0b001..Reserved (do not use)
 *  0b010..Reserved (do not use)
 *  0b011..Reserved (do not use)
 *  0b100..Software pretrigger 0
 *  0b101..Software pretrigger 1
 *  0b110..Software pretrigger 2
 *  0b111..Software pretrigger 3
 */
#define SIM_ADCOPT_ADC0SWPRETRG(x)               (((uint32_t)(((uint32_t)(x)) << SIM_ADCOPT_ADC0SWPRETRG_SHIFT)) & SIM_ADCOPT_ADC0SWPRETRG_MASK)

#define SIM_ADCOPT_ADC0PRETRGSEL_MASK            (0x30U)
#define SIM_ADCOPT_ADC0PRETRGSEL_SHIFT           (4U)
/*! ADC0PRETRGSEL - ADC0 pretrigger source select
 *  0b00..PDB pretrigger (default)
 *  0b01..TRGMUX pretrigger
 *  0b10..Software pretrigger
 *  0b11..Reserved
 */
#define SIM_ADCOPT_ADC0PRETRGSEL(x)              (((uint32_t)(((uint32_t)(x)) << SIM_ADCOPT_ADC0PRETRGSEL_SHIFT)) & SIM_ADCOPT_ADC0PRETRGSEL_MASK)

#define SIM_ADCOPT_ADC1TRGSEL_MASK               (0x100U)
#define SIM_ADCOPT_ADC1TRGSEL_SHIFT              (8U)
/*! ADC1TRGSEL - ADC1 trigger source select
 *  0b0..PDB output
 *  0b1..TRGMUX output
 */
#define SIM_ADCOPT_ADC1TRGSEL(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_ADCOPT_ADC1TRGSEL_SHIFT)) & SIM_ADCOPT_ADC1TRGSEL_MASK)

#define SIM_ADCOPT_ADC1SWPRETRG_MASK             (0xE00U)
#define SIM_ADCOPT_ADC1SWPRETRG_SHIFT            (9U)
/*! ADC1SWPRETRG - ADC1 software pretrigger sources
 *  0b000..Software pretrigger disabled
 *  0b001..Reserved (do not use)
 *  0b010..Reserved (do not use)
 *  0b011..Reserved (do not use)
 *  0b100..Software pretrigger 0
 *  0b101..Software pretrigger 1
 *  0b110..Software pretrigger 2
 *  0b111..Software pretrigger 3
 */
#define SIM_ADCOPT_ADC1SWPRETRG(x)               (((uint32_t)(((uint32_t)(x)) << SIM_ADCOPT_ADC1SWPRETRG_SHIFT)) & SIM_ADCOPT_ADC1SWPRETRG_MASK)

#define SIM_ADCOPT_ADC1PRETRGSEL_MASK            (0x3000U)
#define SIM_ADCOPT_ADC1PRETRGSEL_SHIFT           (12U)
/*! ADC1PRETRGSEL - ADC1 pretrigger source select
 *  0b00..PDB pretrigger (default)
 *  0b01..TRGMUX pretrigger
 *  0b10..Software pretrigger
 *  0b11..Reserved
 */
#define SIM_ADCOPT_ADC1PRETRGSEL(x)              (((uint32_t)(((uint32_t)(x)) << SIM_ADCOPT_ADC1PRETRGSEL_SHIFT)) & SIM_ADCOPT_ADC1PRETRGSEL_MASK)
/*! @} */

